/***************************************************************************/
// METODOLOGIA DE LA PROGRAMACION
//
// AUTOR: MARCO GIRELA VIDA
// GRUPO: 1ºB
// FECHA: xx/05/2023
//
// RELACION DE PROBLEMAS 5
//
// Fichero: .h
/*****************************************************************************/

#ifndef
#define

using namespace std;

/***************************************************************************/
/***************************************************************************/
class
{

private:


public:

    /*************************************************************************/
    //-------------------------CONSTRUCTORES---------------------------------//
    /*************************************************************************/
    // Constructor sin argumentos. 
    // Inicializa todos los campos a valor nulo


    /************************************************************************/
    // Constructor de copia
    // Parámetros: otro (referencia), objeto que sirve de modelo. 
 
    /************************************************************************/
    // Destructor

    /*************************************************************************/
    //----------------------------MÉTODOS------------------------------------//
    /*************************************************************************/
    // Métodos get

    /***************************************************************************/
    // Métodos set

    /***************************************************************************/
    // Método ToString

    /***********************************************************************/
	// Sobrecarga del operador de asignación para copia profunda.
	// Parámetros: otro (referencia), objeto que sirve de modelo. 

	/*************************************************************************/
	//------------------------MÉTODOS PRIVADOS-------------------------------//
	/*************************************************************************/
    // COPIARDATOS
    // Copiar datos desde otro objeto de la clase
    // Parámetros: otro (referencia), objeto que sirve de modelo. 
    //
    // PRE: Se ha reservado memoria para los datos

    /***********************************************************************/
    // RESERVAMEMORIA
    // Pide memoria para guardar una copia de los datos de "otro"
    // Parámetros: otro (referencia), objeto que sirve de modelo. 

    /***********************************************************************/
    // LIBERAMEMORIA

};

#endif